app/controllers/admin/messages_controller.rb

  def index
    @messages = Message.paginate :page => params[:page], :per_page => 100, :order => 'created_at DESC'
---
SELECT * FROM "messages" ORDER BY created_at DESC LIMIT 5 OFFSET 0
SELECT count(*) AS count_all FROM "messages"

  def update
    @message = Message.find(params[:id])

    respond_to do |format|
      if @message.update_attribute(:is_approved,params[:commit] == 'Approve' ? 1 : 0)
---
SELECT * FROM "messages" WHERE ("messages"."id" = 7)
UPDATE "messages" SET "is_approved" = 1, "updated_at" = '2009-07-12 07:04:03' WHERE "id" = 6

  def destroy
    @message = Message.find(params[:id])
    @message.destroy
---
SELECT * FROM "messages" WHERE ("messages"."id" = 7)
DELETE FROM "messages" WHERE "id" = 7