app/controllers/messages_controller.rb

  def load_messages
    @messages = Message.paginate :conditions => ['is_approved', 1], :page => params[:page], :per_page => 20, :order => 'created_at DESC'
---
SELECT * FROM "messages" WHERE (is_approved) ORDER BY created_at DESC LIMIT 5 OFFSET 5
SELECT count(*) AS count_all FROM "messages" WHERE (is_approved)

  def create
    @message = Message.new(params[:message])
    respond_to do |format|
      if @message.save && verify_recaptcha(:model => @message)
---
INSERT INTO "messages" ("name", "message", "updated_at", "is_approved", "created_at") VALUES(NULL, 'message', '2009-07-11 16:15:02', 0, '2009-07-11 16:15:02')